module.exports = {
    "messageVersion": "1.0",
    "invocationSource": "DialogCodeHook",
    "userId": "0aoa38w5kw71aodfl0th65gfb5yrhfn3",
    "sessionAttributes": {
        "allAvailableOptions": "[{\"option\":1,\"title\":\"Option 1   NZD1639.63\",\"fields\":[{\"value\":\"🛫AKL(2017-07-30 21:00)  🛬PVG(2017-07-31 05:40) ✈MU780 ⏱13H \\n\"},{\"value\":\"🛫PVG(2017-07-31 21:00)  🛬LAX(2017-07-31 18:00) ✈MU577 ⏱12H \\n\"},{\"value\":\"🛫LAX(2017-09-12 12:30)  🛬PVG(2017-09-13 17:20) ✈MU586 ⏱14H \\n\"},{\"value\":\"🛫PVG(2017-09-14 01:15)  🛬AKL(2017-09-14 16:55) ✈MU779 ⏱12H \\n\"}]},{\"option\":2,\"title\":\"Option 2   NZD1639.63\",\"fields\":[{\"value\":\"🛫AKL(2017-07-30 21:00)  🛬PVG(2017-07-31 05:40) ✈MU780 ⏱13H \\n\"},{\"value\":\"🛫PVG(2017-07-31 21:00)  🛬LAX(2017-07-31 18:00) ✈MU577 ⏱12H \\n\"},{\"value\":\"🛫LAX(2017-09-12 12:51)  🛬PVG(2017-09-13 17:50) ✈MU8882 ⏱14H \\n\"},{\"value\":\"🛫PVG(2017-09-14 01:15)  🛬AKL(2017-09-14 16:55) ✈MU779 ⏱12H \\n\"}]},{\"option\":3,\"title\":\"Option 3   NZD1789.63\",\"fields\":[{\"value\":\"🛫AKL(2017-07-30 21:00)  🛬PVG(2017-07-31 05:40) ✈MU780 ⏱13H \\n\"},{\"value\":\"🛫PVG(2017-07-31 13:00)  🛬LAX(2017-07-31 10:05) ✈MU583 ⏱12H \\n\"},{\"value\":\"🛫LAX(2017-09-12 12:51)  🛬PVG(2017-09-13 17:50) ✈MU8882 ⏱14H \\n\"},{\"value\":\"🛫PVG(2017-09-14 01:15)  🛬AKL(2017-09-14 16:55) ✈MU779 ⏱12H \\n\"}]},{\"option\":4,\"title\":\"Option 4   NZD1789.63\",\"fields\":[{\"value\":\"🛫AKL(2017-07-30 21:00)  🛬PVG(2017-07-31 05:40) ✈MU780 ⏱13H \\n\"},{\"value\":\"🛫PVG(2017-07-31 13:00)  🛬LAX(2017-07-31 10:05) ✈MU583 ⏱12H \\n\"},{\"value\":\"🛫LAX(2017-09-12 01:05)  🛬PVG(2017-09-13 06:00) ✈MU578 ⏱14H \\n\"},{\"value\":\"🛫PVG(2017-09-14 01:15)  🛬AKL(2017-09-14 16:55) ✈MU779 ⏱12H \\n\"}]},{\"option\":5,\"title\":\"Option 5   NZD1789.63\",\"fields\":[{\"value\":\"🛫AKL(2017-07-30 21:00)  🛬PVG(2017-07-31 05:40) ✈MU780 ⏱13H \\n\"},{\"value\":\"🛫PVG(2017-07-31 13:00)  🛬LAX(2017-07-31 10:05) ✈MU583 ⏱12H \\n\"},{\"value\":\"🛫LAX(2017-09-12 12:30)  🛬PVG(2017-09-13 17:20) ✈MU586 ⏱14H \\n\"},{\"value\":\"🛫PVG(2017-09-14 01:15)  🛬AKL(2017-09-14 16:55) ✈MU779 ⏱12H \\n\"}]},{\"option\":6,\"title\":\"Option 6   NZD1862.13\",\"fields\":[{\"value\":\"🛫AKL(2017-07-30 06:50)  🛬SYD(2017-07-30 08:30) ✈MU8414 ⏱4H \\n\"},{\"value\":\"🛫SYD(2017-07-30 11:00)  🛬PVG(2017-07-30 19:20) ✈MU562 ⏱10H \\n\"},{\"value\":\"🛫PVG(2017-07-30 21:00)  🛬LAX(2017-07-30 18:00) ✈MU577 ⏱12H \\n\"},{\"value\":\"🛫LAX(2017-09-12 12:30)  🛬PVG(2017-09-13 17:20) ✈MU586 ⏱14H \\n\"},{\"value\":\"🛫PVG(2017-09-14 01:15)  🛬AKL(2017-09-14 16:55) ✈MU779 ⏱12H \\n\"}]},{\"option\":7,\"title\":\"Option 7   NZD1862.13\",\"fields\":[{\"value\":\"🛫AKL(2017-07-30 06:50)  🛬SYD(2017-07-30 08:30) ✈MU8414 ⏱4H \\n\"},{\"value\":\"🛫SYD(2017-07-30 11:00)  🛬PVG(2017-07-30 19:20) ✈MU562 ⏱10H \\n\"},{\"value\":\"🛫PVG(2017-07-30 21:00)  🛬LAX(2017-07-30 18:00) ✈MU577 ⏱12H \\n\"},{\"value\":\"🛫LAX(2017-09-12 12:51)  🛬PVG(2017-09-13 17:50) ✈MU8882 ⏱14H \\n\"},{\"value\":\"🛫PVG(2017-09-14 01:15)  🛬AKL(2017-09-14 16:55) ✈MU779 ⏱12H \\n\"}]},{\"option\":8,\"title\":\"Option 8   NZD2098.13\",\"fields\":[{\"value\":\"🛫AKL(2017-07-30 21:00)  🛬PVG(2017-07-31 05:40) ✈MU780 ⏱13H \\n\"},{\"value\":\"🛫PVG(2017-07-31 13:00)  🛬LAX(2017-07-31 10:05) ✈MU583 ⏱12H \\n\"},{\"value\":\"🛫LAX(2017-09-12 12:30)  🛬PVG(2017-09-13 17:20) ✈MU586 ⏱14H \\n\"},{\"value\":\"🛫PVG(2017-09-13 19:55)  🛬SYD(2017-09-14 08:30) ✈MU8439 ⏱11H \\n\"},{\"value\":\"🛫SYD(2017-09-14 13:15)  🛬AKL(2017-09-14 18:25) ✈MU8457 ⏱3H \\n\"}]},{\"option\":9,\"title\":\"Option 9   NZD2098.13\",\"fields\":[{\"value\":\"🛫AKL(2017-07-30 21:00)  🛬PVG(2017-07-31 05:40) ✈MU780 ⏱13H \\n\"},{\"value\":\"🛫PVG(2017-07-31 13:00)  🛬LAX(2017-07-31 10:05) ✈MU583 ⏱12H \\n\"},{\"value\":\"🛫LAX(2017-09-12 12:30)  🛬PVG(2017-09-13 17:20) ✈MU586 ⏱14H \\n\"},{\"value\":\"🛫PVG(2017-09-13 19:55)  🛬SYD(2017-09-14 08:30) ✈MU8439 ⏱11H \\n\"},{\"value\":\"🛫SYD(2017-09-14 11:15)  🛬AKL(2017-09-14 16:25) ✈MU8413 ⏱3H \\n\"}]},{\"option\":10,\"title\":\"Option 10   NZD2098.13\",\"fields\":[{\"value\":\"🛫AKL(2017-07-30 21:00)  🛬PVG(2017-07-31 05:40) ✈MU780 ⏱13H \\n\"},{\"value\":\"🛫PVG(2017-07-31 13:00)  🛬LAX(2017-07-31 10:05) ✈MU583 ⏱12H \\n\"},{\"value\":\"🛫LAX(2017-09-12 12:30)  🛬PVG(2017-09-13 17:20) ✈MU586 ⏱14H \\n\"},{\"value\":\"🛫PVG(2017-09-13 20:20)  🛬SYD(2017-09-14 09:00) ✈MU561 ⏱11H \\n\"},{\"value\":\"🛫SYD(2017-09-14 13:15)  🛬AKL(2017-09-14 18:25) ✈MU8457 ⏱3H \\n\"}]}]",
        "currentPage": "0",
        "qslots": "{\"ReturnDate\":\"2017-09-12\",\"Cabin\":\"Economy\",\"DestinationCity\":\"LAX\",\"DepartureCity\":\"AKL\",\"TripType\":\"round trip\",\"Alliance\":\"2\",\"Adults\":\"1\",\"Infants\":\"0\",\"Option\":null,\"Children\":\"0\",\"DepartureDate\":\"2017-07-30\"}"
    },
    "bot": {
        "name": "TravelAgent",
        "alias": null,
        "version": "$LATEST"
    },
    "outputDialogMode": "Text",
    "currentIntent": {
        "name": "BookFlight",
        "slots": {
            "ReturnDate": "2017-09-12",
            "Cabin": "Economy",
            "DestinationCity": "LAX",
            "DepartureCity": "AKL",
            "TripType": null,
            "Alliance": null,
            "Adults": "1",
            "Infants": "0",
            "Option": null,
            "Children": "0",
            "DepartureDate": "2017-07-30"
        },
        "confirmationStatus": "None"
    },
    "inputTranscript": "I would like to book a flight from AKL to LAX departs on next sunday returns on 12 Sep Economy 1 adult 0 infant 0 child"
};